# Ultralytics 🚀 AGPL-3.0 License
#
# YOLOv8 Selective-Ghost + ECA (Backbone-Only Attention)
# P3/8 - P5/32 outputs
#
# Design Principles:
# 1) GhostConv ONLY for early-stage redundancy (P2 + downsample)
# 2) Preserve P3+ semantic representation
# 3) ONE ECA at backbone end (P5, safest insertion)
# 4) Head fully stable for feature fusion

# =====================
# Parameters
# =====================
nc: 80  # number of classes

scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# =====================
# Backbone
# Selective Ghost Strategy + ECA
# =====================
backbone:
  # [from, repeats, module, args]

  # P1/2
  - [-1, 1, Conv, [64, 3, 2]]                 # 0

  # P2/4 (Ghost SAFE)
  - [-1, 1, GhostConv, [128, 3, 2]]           # 1
  - [-1, 3, C3Ghost, [128, True]]             # 2

  # P3/8 (semantic transition)
  - [-1, 1, GhostConv, [256, 3, 2]]           # 3
  - [-1, 4, C2f, [256, True]]                 # 4

  # P4/16 (NO Ghost)
  - [-1, 1, Conv, [512, 3, 2]]                # 5
  - [-1, 4, C2f, [512, True]]                 # 6

  # - [-1, 1, ECA, [256]]                      # 7  OPTIONAL: can be placed here instead

  # P5/32 (Highest semantics)
  - [-1, 1, Conv, [1024, 3, 2]]               # 7
  - [-1, 2, C2f, [1024, True]]                # 8

  # -------- ECA INSERTION (ONLY ONE) --------
  - [-1, 1, ECA, [512]]                      # 9 

  # Spatial Pyramid Pooling
  - [-1, 1, SPPF, [1024, 5]]                  # 10

# =====================
# Head
# Stable Feature Fusion (NO Ghost)
# =====================
head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]]                  # 12
  - [-1, 3, C2f, [512]]                        # 13

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]]                  # 15
  - [-1, 3, C2f, [256]]                        # 16

  # Downsample P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]                 # 17
  - [[-1, 13], 1, Concat, [1]]                 # 18
  - [-1, 3, C2f, [512]]                        # 19

  # Downsample P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]                 # 20
  - [[-1, 10], 1, Concat, [1]]                 # 21
  - [-1, 3, C2f, [1024]]                       # 22

  # Detect
  - [[16, 19, 22], 1, Detect, [nc]]            # 23
